In [6]:
def addition(n):
    return n + n
numbers = (1, 2, 3, 4)
result = map(addition, numbers)
print(list(result))

[2, 4, 6, 8]

In [7]:
import pandas as pd
import numpy as np
s = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
s

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [8]:
s.map({'cat':'kiteen','dog':'puppy'})

0    kiteen
1     puppy
2       NaN
3       NaN
dtype: object

In [10]:
s.map({'cat':'kitten','dog':'puppy','rabbit':'bunny'})

0    kitten
1     puppy
2       NaN
3     bunny
dtype: object

In [12]:
s.map('I am a {}'.format)

0       I am a cat
1       I am a dog
2       I am a nan
3    I am a rabbit
dtype: object

In [16]:
s.map('I am a {}'.format,na_action='ignore')

0       I am a cat
1       I am a dog
2              NaN
3    I am a rabbit
dtype: object

In [18]:
numbers=(1,2,3,4)
result=map(lambda n: n+n, numbers)
print(list(result))

[2, 4, 6, 8]

In [19]:
x=lambda a,b,c: a+b+c
print(x(1,2,3))

6

In [20]:
n1=[1,2,3]
n2=[4,5,6]
result=map(lambda x,y: x+y,n1,n2)
print(list(result))

[5, 7, 9]

In [23]:
import pandas as pd
values=[['Roshan',455],['Elvish',250],['Deepak',495],['soni',400],['Radhika',350],['vansh',450]]
df=pd.DataFrame(values,columns=['name','Total_Marks'])
df.assign(percentage=lambda x:(x['Total_Marks']/500*500))
df

      name  Total_Marks
0   Roshan          455
1   Elvish          250
2   Deepak          495
3     soni          400
4  Radhika          350
5    vansh          450

In [25]:
import numpy as np
import pandas as pd

In [28]:
values_list = [[15, 2.5, 100], [20, 4.5, 50], [25, 5.2, 80],
               [45, 5.8, 48], [40, 6.3, 70], [41, 6.4, 90],
               [51, 2.3, 111]]
df=pd.DataFrame(values_list,columns=['field_1','field_2','field_3'],index=['a','b','c','d','e','f','g'])
print(df)

   field_1  field_2  field_3
a       15      2.5      100
b       20      4.5       50
c       25      5.2       80
d       45      5.8       48
e       40      6.3       70
f       41      6.4       90
g       51      2.3      111

In [ ]:
df = df.apply(lambda x: np.square(x) if x.name in [
              'a', 'e', 'g'] else x, axis=1)